app/Http/Controllers/Web/Frontend/GamesController.php

            \Illuminate\Support\Facades\Cookie::queue('currentCategory' . auth()->user()->id, $category1, 2678400);
            if( $category1 != '' )
            {
                $cat1 = \VanguardLTE\Category::where(['href' => $category1])->first();
---
select * from `w_categories` where (`href` = 'novomatic') limit 1

                }
                else
                {
                    $categories = \VanguardLTE\Category::where(['parent' => $cat1->id])->pluck('id')->toArray();
---
select `id` from `w_categories` where (`parent` = 31)

                }
            }
            $games = $games->get();
            $jpgs = \VanguardLTE\JPG::where('shop_id', $shop_id)->get();
            $jpgSum = \VanguardLTE\JPG::where('shop_id', $shop_id)->sum('balance');
---
select * from `w_jpg` where `shop_id` = 3
select sum(`balance`) as aggregate from `w_jpg` where `shop_id` = 3

                ])->pluck('original_id'))->groupBy('category_id')->pluck('category_id');
                if( count($cat_ids) )
                {
                    $categories = \VanguardLTE\Category::whereIn('id', $cat_ids)->orderBy('position', 'ASC')->get();
---
select * from `w_categories` where `id` in (3, 4, 5, 9, 18, 29, 31, 33, 34, 45) order by `position` asc

            {
                $currentSliderNum = 'hot';
            }
            $tournament = \VanguardLTE\Tournament::where('shop_id', $shop_id)->where('start', '<=', \Carbon\Carbon::now())->where('end', '>=', \Carbon\Carbon::now())->orderBy('end', 'ASC')->first();
            if( !$tournament )
            {
                $tournament = \VanguardLTE\Tournament::where('shop_id', $shop_id)->where('start', '>=', \Carbon\Carbon::now())->where('end', '>=', \Carbon\Carbon::now())->orderBy('end', 'ASC')->first();
---
select * from `w_tournaments` where `shop_id` = 3 and `start` <= '2022-09-06 15:40:30' and `end` >= '2022-09-06 15:40:30' order by `end` asc limit 1
select * from `w_tournaments` where `shop_id` = 3 and `start` >= '2022-09-06 15:40:30' and `end` >= '2022-09-06 15:40:30' order by `end` asc limit 1