app/Http/Controllers/Web/Frontend/ProfileController.php

        public function ajax(\Illuminate\Http\Request $request)
        {
            $data = [
                'jackpots' => [],
                'jackpotSum' => 0,
                'profile' => [],
                'message' => '',
                'currency' => ''
            ];
            $user = \VanguardLTE\User::where('id', auth()->user()->id)->first();
            if( $user )
            {
                $sms_bonus = \VanguardLTE\SMSBonusItem::where([
                    'user_id' => auth()->user()->id,
                    'status' => 0
                ])->orderBy('id', 'DESC')->first();
                $refund = false;
                $daily_entry = false;
                if( $user->shop && $user->shop->progress_active )
                {
                    $refund = \VanguardLTE\Progress::where([
                        'shop_id' => auth()->user()->shop_id,
                        'rating' => auth()->user()->rating
                    ])->first();
                    $daily_entry = \VanguardLTE\Progress::where([
                        'shop_id' => auth()->user()->shop_id,
                        'day' => date('l'),
                        'rating' => auth()->user()->rating
                    ])->first();
                }
                $rewards = \VanguardLTE\Reward::where([
                    'user_id' => auth()->user()->id,
                    'user_received' => 0,
                    'activated' => 1
                ])->get();
---
select * from `w_sms_bonus_items` where (`user_id` = 942 and `status` = 0) order by `id` desc limit 1
select * from `w_progress` where (`shop_id` = 3 and `rating` = 0) limit 1
select * from `w_progress` where (`shop_id` = 3 and `day` = 'Tuesday' and `rating` = 0) limit 1
select * from `w_rewards` where (`user_id` = 942 and `user_received` = 0 and `activated` = 1)

                ];
                $data['profile']['daily_entry'] = ['available' => ($daily_entry && \Carbon\Carbon::now()->diffInDays(\Carbon\Carbon::parse(auth()->user()->last_daily_entry), false) || $sms_bonus ? true : false)];
            }
            $jackpots = \VanguardLTE\JPG::select([
                'id',
                'balance'
            ])->where('shop_id', auth()->user()->shop_id)->get();
---
select `id`, `balance` from `w_jpg` where `shop_id` = 3
select sum(`balance`) as aggregate from `w_jpg` where `shop_id` = 3

                $data['jackpots'] = $jackpots->toArray();
            }
            $data['jackpotSum'] = \VanguardLTE\JPG::where('shop_id', auth()->user()->shop_id)->sum('balance');
            $tournaments = \VanguardLTE\Tournament::where('shop_id', auth()->user()->shop_id)->where('start', '<=', \Carbon\Carbon::now())->where('end', '>=', \Carbon\Carbon::now()->subMinutes(3))->get();
---
select * from `w_tournaments` where `shop_id` = 3 and `start` <= '2022-09-06 15:41:31' and `end` >= '2022-09-06 15:38:31'