app/User.php

update `w_users` set `username` = '500387704', `w_users`.`updated_at` = '2022-09-06 15:41:31' where `id` = 942 and `is_demo_agent` = 0
update `w_users` set `refunds` = 0, `w_users`.`updated_at` = '2022-09-06 15:41:31' where `id` = 942 and `is_demo_agent` = 0
---
        public static function boot()
        {
            parent::boot();
            self::created(function($model)
            {
                event(new Events\User\Created($model));
                Jobs\UpdateHierarchyUsersCache::dispatch();
                User::where('id', $model->id)->update(['last_daily_entry' => \Carbon\Carbon::now()->subDays(2)]);
            });
            self::saved(function($model)
            {
                User::where('id', $model->id)->update(['username' => Lib\Functions::remove_emoji($model->username)]);
            });
            self::updated(function($model)
            {
                if( $model->refunds <= 0 )
                {
                    User::where('id', $model->id)->update(['refunds' => 0]);